---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.ReverseIterator
source: html/1dff1c5c-571a-ba8a-c0d1-41b914f2301b.htm
---
# Autodesk.Revit.DB.CurveArrArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveArrArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.